Revit 2027 API
CylindricalFace.Radius Property
Radii of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ this[
	int index
] { get; }
Public ReadOnly Property Radius (
	index As Integer
) As XYZ
	Get
public:
property XYZ^ Radius[int index] {
	XYZ^ get (int index);
}
member Radius : XYZ with get
Parameters
index Int32
Property Value
XYZ
See Also
Reference
CylindricalFace Class
Autodesk.Revit.DB Namespace